OpenFOAM-v1812/tutorials/incompressible/simpleFoam/T3A/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication $(getApplication)

( cd validation && ./plot )

#------------------------------------------------------------------------------
